# YOLOv11n-Improved: ж— дәәжңәе°Ҹзӣ®ж ҮжЈҖжөӢдјҳеҢ–зүҲ
# ж”№иҝӣ: P2е°Ҹзӣ®ж ҮжЈҖжөӢеӨҙ + SimAMйӣ¶еҸӮж•°жіЁж„ҸеҠӣ + PConvиҪ»йҮҸеҢ– + BiFPNеҠ жқғиһҚеҗҲ
# и®ӯз»ғж—¶йңҖй…ҚеҗҲ NWD loss + NWD-TAL patch

nc: 1
scales:
  n: [0.50, 0.25, 1024]

# Backbone (with EMA attention)
# Channel trace (after width=0.25): 16вҶ’32вҶ’64вҶ’64вҶ’128вҶ’128вҶ’128вҶ’128вҶ’256вҶ’256вҶ’256вҶ’256
backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2  вҶ’ 16ch
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4  вҶ’ 32ch
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2       вҶ’ 64ch
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8  вҶ’ 64ch
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4       вҶ’ 128ch
  - [-1, 1, SimAM, []]                 # 5 вҳ…SimAM вҶ’ 128ch (zero params)
  - [-1, 1, Conv, [512, 3, 2]]         # 6-P4/16 вҶ’ 128ch
  - [-1, 2, C3k2, [512, True]]         # 7       вҶ’ 128ch
  - [-1, 1, SimAM, []]                 # 8 вҳ…SimAM вҶ’ 128ch (zero params)
  - [-1, 1, Conv, [1024, 3, 2]]        # 9-P5/32 вҶ’ 256ch
  - [-1, 2, C3k2, [1024, True]]        # 10      вҶ’ 256ch
  - [-1, 1, SPPF, [1024, 5]]           # 11      вҶ’ 256ch
  - [-1, 2, C2PSA, [1024]]             # 12      вҶ’ 256ch

# Head: P2 detection + PConv + BiFPN
# Top-down: P5вҶ’P4вҶ’P3вҶ’P2, then Bottom-up: P2вҶ’P3вҶ’P4вҶ’P5
head:
  # --- Top-down path ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13      вҶ’ 256ch (P4 size)
  - [[-1, 8], 1, BiFPN_Concat, [1]]              # 14 вҳ…BiFPN вҶ’ 256+128=384ch
  - [-1, 2, PConv_C3k2, [512]]                   # 15 вҳ…PConv вҶ’ 128ch

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16      вҶ’ 128ch (P3 size)
  - [[-1, 5], 1, BiFPN_Concat, [1]]               # 17 вҳ…BiFPN вҶ’ 128+128=256ch
  - [-1, 2, PConv_C3k2, [256]]                    # 18 вҳ…PConv вҶ’ 64ch  (P3/8)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 19      вҶ’ 64ch (P2 size)
  - [[-1, 2], 1, BiFPN_Concat, [1]]                # 20 вҳ…BiFPN вҶ’ 64+64=128ch
  - [-1, 2, PConv_C3k2, [128]]                     # 21 вҳ…PConv вҶ’ 32ch  (P2/4) вҳ…P2жЈҖжөӢеӨҙ

  # --- Bottom-up path ---
  - [-1, 1, Conv, [128, 3, 2]]                     # 22      вҶ’ 32ch
  - [[-1, 18], 1, BiFPN_Concat, [1]]               # 23 вҳ…BiFPN вҶ’ 32+64=96ch
  - [-1, 2, PConv_C3k2, [256]]                     # 24 вҳ…PConv вҶ’ 64ch  (P3/8)

  - [-1, 1, Conv, [256, 3, 2]]                     # 25      вҶ’ 64ch
  - [[-1, 15], 1, BiFPN_Concat, [1]]               # 26 вҳ…BiFPN вҶ’ 64+128=192ch
  - [-1, 2, PConv_C3k2, [512]]                     # 27 вҳ…PConv вҶ’ 128ch (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]                     # 28      вҶ’ 128ch
  - [[-1, 12], 1, BiFPN_Concat, [1]]               # 29 вҳ…BiFPN вҶ’ 128+256=384ch
  - [-1, 2, C3k2, [1024, True]]                    # 30      вҶ’ 256ch (P5/32)

  - [[21, 24, 27, 30], 1, Detect, [nc]]            # 31 Detect(P2, P3, P4, P5)
